<template>
  <main class="main">
    <h1>한사랑교회 414생활관</h1>

    <Logos/>

    <p>
      414란 4세부터 14세로 대표되는 <strong>다음세대</strong>를 의미합니다.<br>
      생활관에서 아이들은 함께 또 홀로 학습하며 인성과 신앙을 훈련받게 됩니다.
    </p>

    <p>
      414생활관은 자녀들이 매일 교회에서 함께 생활하며 메타인지 자기주도 학습을 하는 신앙과 삶의 터전입니다.
    </p>

    <section>
      <h2>메타인지</h2>
      메타인지란 인지에 대한 인지, 즉 내가 무엇을 알고 모르는지에 대해 아는 것입니다. 어떤 사물과 그에 대한 자기 생각을 스스로 판단할 수 있는 능력입니다.

      414생활관은 이 능력을 배양하여 기존 주입식 교육과 사교육으로 도달할 수 없는 학습 성취를 목표로 하는 교육의 대안입니다.
    </section>

    <section>
      <h2>414 학습 전략</h2>
      414생활관은 인출, 정교화, 반추의 과정을 통해 메타인지를 배양합니다.

      <div>[그림]</div>

      인출 - 교재와 필기의 도움없이 기억에서 정보를 꺼내 나열해 보기.
      정교화 - 기존의 지식과 새로운 지식을 서로 연결해 보기.
      반추 - 인출 + 정교화 과정을 돌이켜보며 만들어진 지식을 다른 사람에게 설명할 수 있을 정도까지 나만의 지식으로 만듦.
    </section>
  </main>
</template>

<script>
import Logos from '~/components/Logos.vue';

export default {
  components: {
    Logos,
  },
  mounted() {

  }
}
</script>
